daily_works/2019-05/2019-05-30/request-transferBalance-template.xml

<?xml version = "1.0" encoding = "UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:api="http://cps.huawei.com/synccpsinterface/api_requestmgr" xmlns:req="http://cps.huawei.com/synccpsinterface/request" xmlns:com="http://cps.huawei.com/synccpsinterface/common">
	<soapenv:Header/> 
		<soapenv:Body> 
			<api:Request> 
				<req:Header> 
					<req:Version isMultiple="false" defaultValue="1.0" required="true"/>
					<req:CommandID isMultiple="false" defaultValue="InitTrans_Canvasser Initiate Allocation" required ="true"/>
					<req:OriginatorConversationID isMultiple="false" defaultValue="TRANS_ID_IN_CONVERTER_TEMPLATE" required ="true"/> <!-- Transaction ID - Reference Number -->
					<req:Caller> 
						<req:CallerType isMultiple="false" source="" lookup-type="1" lookup-entity-type-id="307" entity-id="1" required="true"/>
						<req:ThirdPartyID isMultiple="false" source="" lookup-type="1" lookup-entity-type-id="307" entity-id="2" required="true"/>
						<req:Password isMultiple="false" source="" lookup-type="1" lookup-entity-type-id="307" entity-id="3" required ="true"/>
						<req:ResultURL isMultiple="false" source="" lookup-type="1" lookup-entity-type-id="307" entity-id="4" required ="true"/>
					</req:Caller> 
					<req:KeyOwner isMultiple="false" defaultValue="1" required ="true"/>
					<req:Timestamp isMultiple="false" defaultValue="" lookup-type="4" date-to-format="yyyyMMddHHmmss" required ="true"/>
				</req:Header>
				<req:Body> 
					<req:Identity> 
						<req:Initiator> 
							<req:IdentifierType isMultiple="false" source="" lookup-type="1" lookup-entity-type-id="307" entity-id="5" required ="true"/>
							<req:Identifier isMultiple="false" source="" lookup-type="1" lookup-entity-type-id="307" entity-id="6" required ="true"/>
							<req:SecurityCredential isMultiple="false" source="" lookup-type="1" lookup-entity-type-id="307" entity-id="7" required ="true"/>
							<!--req:ShortCode isMultiple="false" defaultValue="123456712" required ="true"/-->
						</req:Initiator> 
						<req:ReceiverParty> 
							<req:IdentifierType isMultiple="false" defaultValue="4" required ="true"/> 
							<req:Identifier isMultiple="false" source="organization.org_id" lookup-type="3" schema="snoc" collection="organization" type="number" required ="true"/> 
						</req:ReceiverParty> 
					</req:Identity> 
					<req:TransactionRequest> 
						<req:Parameters>
							<req:Amount isMultiple="false" source="" required ="true"/> 
							<req:Currency isMultiple="false" source="" lookup-type="1" lookup-entity-type-id="302" required ="true"/> 
						</req:Parameters>
					</req:TransactionRequest> 
				</req:Body> 
		</api:Request> 
	</soapenv:Body> 
</soapenv:Envelope>